<h2 align='center' style='color:purple'>Outlier detection and removal using z-score in python pandas</h2>

<img src="img.jpg" width="600" height="650">

In [4]:
import pandas as pd
import matplotlib
from matplotlib import pyplot as plt

In [5]:
dataset = pd.read_csv("heights.csv")
dataset.head()

  gender     height
0   Male  73.847017
1   Male  68.781904
2   Male  74.110105
3   Male  71.730978
4   Male  69.881796

<h3 style='color:purple'>Calculate the Z Score</h3>

<h4 style='color:green'>Standard deviation formula: </h4>

<img align='left' height="600" width="500" src="standard-deviation.png" />

<h4 style='color:green'>Z-score formula: </h4>

<img align='left' height="400" width="300" src="zscore.png" />

In [6]:
dataset['zscore'] = ( dataset.height - dataset.height.mean() ) / dataset.height.std()
dataset

      gender     height    zscore
0       Male  73.847017  1.943964
1       Male  68.781904  0.627505
2       Male  74.110105  2.012343
3       Male  71.730978  1.393991
4       Male  69.881796  0.913375
...      ...        ...       ...
9995  Female  66.172652 -0.050658
9996  Female  67.067155  0.181830
9997  Female  63.867992 -0.649655
9998  Female  69.034243  0.693090
9999  Female  61.944246 -1.149651

[10000 rows x 3 columns]

**Get data points that has z score higher than 3 or lower than -3. Another way of saying same thing is get data points that are more than 3 standard deviation away**

**Here is the list of all outliers**

In [9]:
dataset[(dataset.zscore<-3) | (dataset.zscore>3)]

      gender     height    zscore
994     Male  78.095867  3.048271
1317    Male  78.462053  3.143445
2014    Male  78.998742  3.282934
3285    Male  78.528210  3.160640
3757    Male  78.621374  3.184854
6624  Female  54.616858 -3.054091
9285  Female  54.263133 -3.146027

<h3 style='color:purple'>Remove the outliers and produce new dataframe</h3>

In [11]:
remove_outliers = dataset[(dataset.zscore>-3) & (dataset.zscore<3)]
remove_outliers

      gender     height    zscore
0       Male  73.847017  1.943964
1       Male  68.781904  0.627505
2       Male  74.110105  2.012343
3       Male  71.730978  1.393991
4       Male  69.881796  0.913375
...      ...        ...       ...
9995  Female  66.172652 -0.050658
9996  Female  67.067155  0.181830
9997  Female  63.867992 -0.649655
9998  Female  69.034243  0.693090
9999  Female  61.944246 -1.149651

[9993 rows x 3 columns]

In [13]:
dataset.shape, remove_outliers.shape

((10000, 3), (9993, 3))